import dotenv
import os

from langchain_google_genai import GoogleGenerativeAI
from langchain_core.prompts import PromptTemplate


dotenv.load_dotenv()

api_key = os.getenv("GEMINI_API_KEY")

llm = GoogleGenerativeAI(
    model="gemini-3.5-flash-lite",
    api_key=api_key
)

# Завдання 1
# Напишіть промпт для створення плану навчального
# курсу з певної теми для цільової айдиторії(початківці,
# професіонали, діти, тощо).
# Вхідні параметри: тема, опис цільової аудиторії
# Реалізуйте двома способами:
#  Zero-shot
#  Few-shot
#
#  Zero-shot

# prompt_zero_shot = PromptTemplate.from_template("""
# Ти -- розробник навчальних курсів.
#
# Твоя задача -- створити план навчального курсу
# для вказаної теми та цільової аудиторії.
#
# ### ТЕМА КУРСУ
# {topic}
#
# ### ЦІЛЬОВА АУДИТОРІЯ
# {audience}
#
# Створи структурований план курсу.
#
# Для кожного розділу вкажи:
# 1. Назву розділу.
# 2. Основні теми, які будуть вивчатися.
# 3. Практичне завдання.
#
# Курс повинен відповідати рівню підготовки
# цільової аудиторії.
#
# Наприкінці вкажи очікувані результати навчання.
# """
# )
#
# chain_zero_shot = prompt_zero_shot | llm
#
#
# data = {
#     "topic": "Python",
#     "audience": "початківці без досвіду програмування"
# }
#
# response = chain_zero_shot.invoke(data)
#
# print("ZERO-SHOT:")
# print(response)

#  Few-shot
prompt_few_shot = PromptTemplate.from_template("""
Ти -- розробник навчальних курсів.

Твоя задача -- створити план навчального курсу
для вказаної теми та цільової аудиторії.

Орієнтуйся на наведені приклади.

### ПРИКЛАД 1

Тема:
Python

Цільова аудиторія:
Початківці без досвіду програмування.

План курсу:

1. Вступ до Python
   - Що таке Python.
   - Встановлення Python.
   - Перша програма.
   - Практичне завдання: написати програму "Hello World".

2. Змінні та типи даних
   - Числа, рядки, логічні значення.
   - Створення та використання змінних.
   - Практичне завдання: створити простий калькулятор.
   
3. Умови та цикли
   - if / else.
   - for та while.
   - Практичне завдання: створити програму для перевірки чисел.

Очікуваний результат:
Учень зможе писати прості програми на Python.


### ПРИКЛАД 2

Тема:
Комп'ютерний зір

Цільова аудиторія:
Студенти, які вже знають Python та основи програмування.

План курсу:

1. Основи комп'ютерного зору
   - Зображення та пікселі.
   - Основи OpenCV.
   - Практичне завдання: завантаження та обробка зображення.

2. Обробка зображень
   - Фільтрація.
   - Пошук контурів.
   - Робота з кольорами.
   - Практичне завдання: виділення об'єктів на зображенні.

3. Розпізнавання об'єктів
   - Основи детекції.
   - YOLO.
   - Практичне завдання: створення простого детектора об'єктів.

Очікуваний результат:
Учень зможе виконувати базову обробку зображень
та використовувати моделі для детекції об'єктів.


### НОВЕ ЗАВДАННЯ

Тема:
{topic}

Цільова аудиторія:
{audience}

Створи структурований план навчального курсу.

Для кожного розділу вкажи:
1. Назву розділу.
2. Основні теми.
3. Практичне завдання.

План повинен відповідати рівню підготовки
цільової аудиторії.

Наприкінці вкажи очікувані результати навчання.
"""
)

chain_few_shot = prompt_few_shot | llm


data = {
    "topic": "JavaScript",
    "audience": "школярі 14-16 років, які ніколи не програмували"
}

response = chain_few_shot.invoke(data)

print("\nFEW-SHOT:")
print(response)