import dotenv
import os

from langchain_google_genai import GoogleGenerativeAI
from langchain_core.prompts import PromptTemplate


dotenv.load_dotenv()

api_key = os.getenv("GEMINI_API_KEY")


llm = GoogleGenerativeAI(
    model="models/gemini-3.5-flash-lite",
    api_key=api_key,
)

# Завдання 1
# Напишіть промпт для генерації коду функції для
# вирішення певної задачі.
# Вхідні параметри – мова програмування, опис задачі
# Реалізуйте двома способами:
#  Zero-shot
#  Few-shot

#  Zero-shot

# prompt_zero_shot = PromptTemplate.from_template("""
# Ти -- генератор програмного коду.
#
# Твоя задача -- написати функцію для вирішення задачі,
# яку описав користувач.
#
# Вхідні дані:
# - Мова програмування: {language}
# - Опис задачі: {task}
#
# Вимоги:
# 1. Напиши тільки код функції.
# 2. Не використовуй зайві бібліотеки, якщо вони не потрібні.
# 3. Код повинен бути готовим до запуску.
# 4. Назва та параметри функції повинні відповідати задачі.
#
# МОВА ПРОГРАМУВАННЯ:
# {language}
#
# ЗАДАЧА:
# {task}
#
# КОД:
# """
# )
#
# chain_zero_shot = prompt_zero_shot | llm
#
#
# data = {
#     "language": "Python",
#     "task": "Написати функцію, яка приймає список чисел та повертає найбільше число."
# }
#
# response = chain_zero_shot.invoke(data)
#
# print(response)

#  Few-shot

# prompt_few_shot = PromptTemplate.from_template("""
# Ти -- генератор програмного коду.
#
# Твоя задача -- написати функцію для вирішення задачі,
# яку описав користувач.
#
# Ось приклади правильного виконання:
#
# ### ПРИКЛАД 1
#
# Мова програмування:
# Python
#
# Задача:
# Написати функцію, яка приймає два числа та повертає їх суму.
#
# Код:
# def add(a, b):
#     return a + b
#
#
# ### ПРИКЛАД 2
#
# Мова програмування:
# Python
#
# Задача:
# Написати функцію, яка приймає список чисел та повертає суму всіх чисел.
#
# Код:
# def sum_numbers(numbers):
#     return sum(numbers)
#
#
# ### ПРИКЛАД 3
#
# Мова програмування:
# Java
#
# Задача:
# Написати функцію, яка приймає два числа та повертає більше з них.
#
# Код:
# public static int max(int a, int b) {{
#     return Math.max(a, b);
# }}
#
#
# ### НОВЕ ЗАВДАННЯ
#
# Мова програмування:
# {language}
#
# Задача:
# {task}
#
# Напиши тільки код функції.
# """
# )
#
# chain_few_shot = prompt_few_shot | llm
#
#
# data = {
#     "language": "Python",
#     "task": "Написати функцію, яка приймає список чисел та повертає найбільше число."
# }
#
# response = chain_few_shot.invoke(data)
#
# print(response)

# Завдання 2
# Напишіть промпт для переведення тексту з
# неформального стилю в формальний
# Вхідні параметри – текст
# Реалізуйте двома способами:
#  Zero-shot
#  Few-shot

#  Zero-shot

# prompt_zero_shot = PromptTemplate.from_template("""
# Ти -- редактор тексту.
#
# Твоя задача -- перетворити текст з неформального стилю
# у формальний стиль.
#
# Зберігай основний зміст тексту, але:
# - використовуй формальну та ввічливу мову;
# - прибирай сленг та розмовні вирази;
# - не додавай нової інформації;
# - не змінюй зміст повідомлення.
#
# ### ВХІДНИЙ ТЕКСТ
# {text}
#
# ### ФОРМАЛЬНИЙ ТЕКСТ
# """
# )
#
# chain_zero_shot = prompt_zero_shot | llm
#
#
# data = {
#     "text": "Привіт! Можеш, будь ласка, скинути мені той звіт, бо він мені дуже потрібен?"
# }
#
# response = chain_zero_shot.invoke(data)
#
# print("ZERO-SHOT:")
# print(response)

#  Few-shot

# prompt_few_shot = PromptTemplate.from_template("""
# Ти -- редактор тексту.
#
# Твоя задача -- перетворити неформальний текст
# у формальний стиль.
#
# Орієнтуйся на наведені приклади.
#
# ### ПРИКЛАД 1
#
# Неформальний текст:
# Привіт! Можеш скинути мені файл?
#
# Формальний текст:
# Добрий день! Чи могли б Ви, будь ласка, надіслати мені файл?
#
#
# ### ПРИКЛАД 2
#
# Неформальний текст:
# Привіт, я не встиг зробити завдання, можна здати його завтра?
#
# Формальний текст:
# Добрий день! Я не встиг виконати завдання у встановлений термін.
# Чи можу я надати його завтра?
#
#
# ### ПРИКЛАД 3
#
# Неформальний текст:
# Дякую за допомогу, ти дуже виручив!
#
# Формальний текст:
# Дякую Вам за надану допомогу.
#
#
# ### НОВИЙ ТЕКСТ
#
# Неформальний текст:
# {text}
#
# Перетвори цей текст у формальний стиль.
# Збережи його основний зміст та не додавай нової інформації.
#
# ### ФОРМАЛЬНИЙ ТЕКСТ
# """
# )
#
# chain_few_shot = prompt_few_shot | llm
#
#
# data = {
#     "text": "Привіт! Можеш, будь ласка, скинути мені той звіт, бо він мені дуже потрібен?"
# }
#
# response = chain_few_shot.invoke(data)
#
# print("\nFEW-SHOT:")
# print(response)

# Завдання 3
# Прочитайте файл data\lesson10\products.txt з описом
# Практичне завдання
# послуг СПА. Напишіть промпт для рекомендації послуги
# виходячи з запиту користувача
# Вхідні параметри – опис товарів, запит користувача
# Реалізуйте двома способами:
#  Zero-shot
#  Chain of Thoughts

with open("data/lesson10/products.txt", "r", encoding="utf-8") as file:
    products = file.read()

#  Zero-shot

# prompt_zero_shot = PromptTemplate.from_template("""
# Ти -- консультант SPA-салону.
#
# Твоя задача -- рекомендувати клієнту найбільш підходящу
# SPA-послугу виходячи з його запиту.
#
# ### ДОСТУПНІ ПОСЛУГИ
# {products}
#
# ### ЗАПИТ КОРИСТУВАЧА
# {user_query}
#
# Проаналізуй запит користувача та обери найбільш підходящу
# послугу з наведеного списку.
#
# У відповіді:
# 1. Назви рекомендовану послугу.
# 2. Коротко поясни, чому вона підходить користувачу.
# 3. Не рекомендуй послуги, яких немає у списку.
# """
# )
#
# chain_zero_shot = prompt_zero_shot | llm
#
#
# data = {
#     "products": products,
#     "user_query": "Я дуже втомився після роботи та хочу розслабитися."
# }
#
# response = chain_zero_shot.invoke(data)
#
# print("ZERO-SHOT:")
# print(response)

#  Chain of Thoughts

prompt_cot = PromptTemplate.from_template("""
Ти -- консультант SPA-салону.

Твоя задача -- рекомендувати найбільш підходящу SPA-послугу
для користувача.

### ДОСТУПНІ ПОСЛУГИ
{products}

### ЗАПИТ КОРИСТУВАЧА
{user_query}

Виконай аналіз послідовно:

1. Визнач основну потребу користувача.
2. Визнач, які характеристики SPA-послуги відповідають цій потребі.
3. Порівняй підходящі послуги з доступного списку.
4. Обери найкращий варіант.
5. Дай коротке пояснення свого вибору.

Не використовуй послуги, яких немає у списку.

У відповіді покажи тільки результат аналізу та фінальну рекомендацію,
без детального опису внутрішнього процесу міркування.

ФОРМАТ ВІДПОВІДІ:

Потреба клієнта: ...

Рекомендована послуга: ...

Чому підходить: ...
"""
)

chain_cot = prompt_cot | llm


data = {
    "products": products,
    "user_query": "Я дуже втомився після роботи та хочу розслабитися."
}

response = chain_cot.invoke(data)

print("\nCHAIN OF THOUGHTS:")
print(response)